
&AtClient
Procedure ТоварыЦенаПриИзменении(Item)
	ТекущаяСтрока = Элементы.Товары.CurrentData;
	ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока);
EndProcedure
&AtClient
Procedure ТоварыКоличествоПриИзменении(Item)
	ТекущаяСтрока = Элементы.Товары.CurrentData;
	ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока);
EndProcedure

&AtClient
Procedure ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока)
	
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		Object.СуммаДокумента = Object.Товары.Total("Сумма"); 
	
EndProcedure

